# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline

# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# File to Load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_df = pd.read_csv(city_data_to_load)
ride_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [2]:
# Combine the data into a single dataset
pyber_df = pd.merge(ride_df, city_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.739411e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.343912e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.005066e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.149245e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.908451e+12,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [3]:
#  1. Get the total rides for each city type
rides_by_type = pyber_df.groupby("type").count()["ride_id"]
rides_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [4]:
# 2. Get the total drivers for each city type
drivers_by_type = city_df.groupby(["type"]).sum()["driver_count"]
drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [5]:
#  3. Get the total amount of fares for each city type
fares_by_type = pyber_df.groupby(["type"]).sum()["fare"]
fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [6]:
#  4. Get the average fare per ride for each city type. 
avg_ride_fare_by_type = fares_by_type/rides_by_type
avg_ride_fare_by_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [7]:
# 5. Get the average fare per driver for each city type. 
avg_driver_fare_by_type = fares_by_type/drivers_by_type
avg_driver_fare_by_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [8]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame({"City Type":['Rural', 'Suburban', 'Urban'],
                                 "Total Rides":[125, 625, 1625],
                                 "Total Drivers":[78,490,2405], 
                                 "Total Fares":[4327.93,19356.33,39854.38],
                                 "Average Fare per Ride":[34.623440, 30.970128, 24.525772],
                                 "Average Fare per Driver":[55.486282, 39.502714, 16.571468]
                                 })
# Set index to city type
pyber_summary_df = pyber_summary_df.set_index("City Type")

pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
City Type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [9]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [10]:
# Double check column format types
pyber_summary_df.dtypes

Total Rides                  int64
Total Drivers                int64
Total Fares                float64
Average Fare per Ride      float64
Average Fare per Driver    float64
dtype: object

In [11]:
#  8. Format the columns.

# Total Rides
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format) 

# Total Drivers
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)

# Total Fares
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)

# Avg Fare Per Ride
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:.2f}".format) 

# Avg Fare per Driver
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:.2f}".format)

pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [21]:
# 1. Read the merged DataFrame
pyber_df.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.739411e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.343912e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.005066e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.149245e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.908451e+12,46,Urban
5,South Latoya,2019-03-11 12:26,9.52,1.994999e+12,10,Urban
6,New Paulville,2019-02-27 11:17,43.25,7.932084e+11,44,Urban
7,Simpsonburgh,2019-04-26 0:43,35.98,1.119539e+11,21,Urban
8,South Karenland,2019-01-08 3:28,35.09,7.995623e+12,4,Urban
9,North Jasmine,2019-03-09 6:26,42.81,5.327642e+12,33,Urban

In [22]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
pyberfares_grouped = pyber_df.groupby(["type","date"]).sum()[["fare"]]

pyberfares_grouped

                         fare
type  date
Rural 2019-01-01 9:45   43.69
      2019-01-02 11:18  52.12
      2019-01-03 19:51  19.90
      2019-01-04 3:31   24.88
      2019-01-06 7:38   47.33
...                       ...
Urban 2019-05-08 1:54   32.69
      2019-05-08 2:31   41.33
      2019-05-08 4:20   21.99
      2019-05-08 4:39   18.45
      2019-05-08 7:29   18.55

[2364 rows x 1 columns]

In [23]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
pyberfares_grouped = pyberfares_grouped.reset_index()

In [24]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
pyber_pivot = pyberfares_grouped.pivot(index="date", columns="type", values="fare")
pyber_pivot.head(10)

type              Rural  Suburban  Urban
date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
2019-01-01 14:52    NaN     31.15    NaN
2019-01-01 17:22    NaN       NaN  42.11
2019-01-01 21:04    NaN       NaN  11.71
2019-01-01 2:07     NaN     24.07    NaN
2019-01-01 3:46     NaN       NaN   7.57

In [25]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
pyber_JanApr = pyber_pivot.loc['2019-01-01':'2019-04-29']
pyber_JanApr

type              Rural  Suburban  Urban
date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
...                 ...       ...    ...
2019-04-28 4:34     NaN       NaN  40.46
2019-04-28 8:15     NaN       NaN  22.86
2019-04-28 9:03     NaN       NaN  15.00
2019-04-28 9:10     NaN       NaN   5.73
2019-04-28 9:25     NaN       NaN  37.35

[2182 rows x 3 columns]

In [28]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
pyber_JanApr["date"] = pd.to_datetime(pyber_JanApr["date"])

KeyError: 'date'

In [27]:
# 7. Check that the datatype for the index is datetime using df.info()
pyber_JanApr.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2182 entries, 2019-01-01 0:08 to 2019-04-28 9:25
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rural     114 non-null    float64
 1   Suburban  570 non-null    float64
 2   Urban     1501 non-null   float64
dtypes: float64(3)
memory usage: 68.2+ KB

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')